part2/test/load/person-create.yml
config:
  target: 'https://f08d33qq98.execute-api.us-east-1.amazonaws.com/prod'
  processor: "./person-create.js"
  phases:
    - duration: 10
      arrivalRate: 1
#    - duration: 10
#      arrivalRate: 100
scenarios:
  - flow:
    - function: "generateRandomData"
    - post:
        url: "/v1/person/create"
        json:
          control: {}
          data:
            name: "{{name}}"
            email: "{{email}}"